Repository: Mu-L/pdfsam
Catalog: pdfsam-i18n/po/*.po
Languages: ar, lv, th

source: File {0} saved
ar: تم حفظ الملف {0}
lv: Fails {0} saglabāts
th: ไฟล์ {0} บันทึกแล้ว

source: Error saving content to clipboard
ar: حدث خطأ أثناء حفظ المحتوى إلى الحافظة
lv: Kļūda saglabājot saturu starpliktuvē
th: ข้อผิดพลาดในการบันทึกเนื้อหาลงคลิปบอร์ด

source: Follow us on Bluesky
ar: Последвайте ни в Bluesky
lv: Seko mums pakalpojumā Bluesky
th: ติดตามเราบน Bluesky

source: Sets the application font
ar: Задава шрифта на приложението
lv: Iestata lietojumprogrammas fontu
th: ตั้งค่าแบบอักษรของแอปพลิเคชัน

source: Default
ar: По подразбиране
lv: Noklusējuma
th: ค่าเริ่มต้น

source: Light
ar: Светъл
lv: Gaišs
th: สว่าง

source: Dark
ar: Тъмна
lv: Tumšs
th: มืด

source: Unlock selected
ar: Отключи избраните
lv: Atslēgt atlasīto
th: ปลดล็อกที่เลือก

source: Workspace has changed
lv: Darbvieta ir mainījusies
th: พื้นที่ทำงานมีการเปลี่ยนแปลง

source: Do you want to save it?
lv: Vai vēlaties to saglabāt?
th: คุณต้องการบันทึกหรือไม่

source: Set as pace for all
th: ตั้งเป็นจังหวะสำหรับทั้งหมด

source: Split at this bookmark level
th: แยกที่ระดับบุ๊กมาร์กนี้

source: Select the bookmark depth level at which to split the document
th: เลือกระดับความลึกของบุ๊กมาร์กที่จะใช้แยกเอกสาร

source: Bookmark level
th: ระดับบุ๊กมาร์ก

source: Bookmark level selector
th: ตัวเลือกระดับคั่นหน้า

source: Select a bookmark level
th: เลือกระดับบุ๊กมาร์ก

source: Select to split the PDF after a predefined set of pages
th: เลือกเพื่อแยก PDF หลังจากชุดหน้าที่กำหนดไว้ล่วงหน้า

source: Predefined set of pages to split after
th: ชุดหน้าสำเร็จรูปสำหรับแยกหลังจาก

source: Choose which predefined set of pages to split after (odd pages, even pages or every page)
th: เลือกชุดหน้ากระดาษที่กำหนดไว้ล่วงหน้าเพื่อแบ่งหลังจาก (หน้าคี่ หน้าคู่ หรือทุกหน้า)

source: Select to split the document after specific page numbers
th: เลือกแยกเอกสารหลังจากหน้าที่ระบุ

source: Page numbers to split at
th: เลขหน้าที่จะแยก

source: Enter comma separated positive page numbers (Ex. 1,5,12...)
th: ป้อนเลขหน้าที่เป็นบวกคั่นด้วยลูกน้ำ (เช่น 1,5,12...)

source: Select to split the document every 'n' pages
th: เลือกแยกเอกสารทุก 'n' หน้า

source: Number of pages for split
th: จำนวนหน้าสำหรับการแยก

source: Enter a positive number of pages
th: ป้อนจำนวนหน้าเป็นบวก

source: Split at this size
th: แยกที่ขนาดนี้

source: Enter a positive integer for the maximum file size
th: ป้อนจำนวนเต็มบวกสำหรับขนาดไฟล์สูงสุด

source: Size unit for the split file size
th: หน่วยขนาดสำหรับขนาดไฟล์ที่แยก

source: Page selection for rotation
th: การเลือกหน้าสำหรับการหมุน

source: Choose which pages to rotate: all, even, or odd
th: เลือกหน้าที่จะหมุน: ทั้งหมด, คู่, หรือ คี่

source: Rotation angle
th: มุมหมุน

source: Choose the rotation angle to apply
th: เลือกมุมการหมุนที่จะนำไปใช้

source: Set pages you want to rotate (ex: 2 or 5-23 or 2,5-7,12-)
th: กำหนดหน้าที่คุณต้องการหมุน (เช่น: 2 หรือ 5-23 หรือ 2,5-7,12-)

source: Pages normalization
th: การทำให้หน้าเป็นมาตรฐาน

source: Interactive forms (AcroForms)
th: แบบฟอร์มเชิงโต้ตอบ (แอคโรฟอร์ม)

source: Bookmarks handling
th: การจัดการบุ๊กมาร์ก

source: Table of contents
th: สารบัญ

source: Repeating PDF file
th: ไฟล์ PDF ที่ซ้ำกัน

source: There are news available
th: มีข่าวสารใหม่

source: selected
th: เลือกแล้ว

source: {0} (with notification)
th: {0} (พร้อมแจ้งเตือน)

source: Collapse the sidebar
th: พับแถบด้านข้าง

source: Expand the sidebar
th: ขยายแถบด้านข้าง

source: PDF files to open
th: ไฟล์ PDF เพื่อเปิด

source: file list
th: รายการไฟล์

source: Available tasks
th: งานพร้อมใช้งาน

source: Log messages
th: บันทึกข้อความ

source: Save the log messages to a text file
th: บันทึกข้อความบันทึกลงในไฟล์ข้อความ

source: Close the log panel
th: ปิดแผงล็อก

source: News items
th: ข่าวสาร

source: Close news panel
th: ปิดแผงข่าว

source: Help for {0}
th: วิธีใช้สำหรับ {0}

source: Log register rows
th: บันทึกแถวทะเบียน

source: Language
th: ภาษา

source: Startup tool
th: เครื่องมือเริ่มต้น

source: Theme
th: ธีม

source: Font
th: ฟอนต์

source: Font size
th: ขนาดตัวอักษร

source: Default PDF version
th: เวอร์ชัน PDF ค่าเริ่มต้น

source: Manually select the output destination directory
th: เลือกโฟลเดอร์ปลายทางผลลัพธ์ด้วยตนเอง

source: Default prefix
th: คำนำหน้าเริ่มต้น

source: Default prefix for output file names
th: คำนำหน้าเริ่มต้นสำหรับชื่อไฟล์ผลลัพธ์

source: Right click to add special prefix keywords
th: คลิกขวาเพื่อเพิ่มคีย์เวิร์ดนำหน้าพิเศษ

source: Properties table
th: ตารางคุณสมบัติ

source: Properties
th: คุณสมบัติ

source: Empty
th: ว่าง

source: Notification
th: การแจ้งเตือน

source: Close notification
th: ปิดการแจ้งเตือน

source: Open the url {0}
th: เปิด URL {0}

source: Clear the selected PDF document
th: ล้างเอกสาร PDF ที่เลือกไว้

source: PDF encryption status
th: สถานะการเข้ารหัส PDF

source: PDF document password
th: รหัสผ่านเอกสาร PDF

source: Drag and drop PDF files here or use the Add button above
th: ลากและวางไฟล์ PDF ที่นี่ หรือใช้ปุ่มเพิ่มด้านบน

source: PDF documents selection table
th: ตารางการเลือกเอกสาร PDF

source: PDF selection table
th: ตารางเลือก PDF

source: PDF documents selection table, {0} documents
th: ตารางเลือกเอกสาร PDF, {0} เอกสาร

source: {0} selected pages
th: {0} หน้าที่เลือก

source: Size: {0}
th: ขนาด: {0}

source: Modified: {0}
th: แก้ไขเมื่อ: {0}

source: Number of total pages
th: จำนวนหน้าทั้งหมด

source: File name: {0}
th: ชื่อไฟล์: {0}

source: Row {0}
th: แถว {0}

source: {0} pages
th: {0} หน้า

source: Set selected pages (ex: 2 or 5-23 or 2,5-7,12-)
th: กำหนดหน้าที่เลือก (เช่น: 2 หรือ 5-23 หรือ 2,5-7,12-)

source: Select a PDF destination file
th: เลือกไฟล์ปลายทาง PDF

source: Browse for destination PDF file
th: เรียกดูไฟล์ PDF ปลายทาง

source: Browse for {0}
th: เลือกหา {0}

source: Compress the output PDF file
th: บีบอัดไฟล์ PDF ผลลัพธ์

source: Select a PDF file
th: เลือกไฟล์ PDF

source: Browse for source PDF file
th: เรียกดูไฟล์ PDF ต้นฉบับ

source: Output PDF version
th: เวอร์ชัน PDF ที่ส่งออก

source: Output PDF version selector
th: ตัวเลือกเวอร์ชัน PDF ที่ส่งออก

source: Output directory
th: ไดเรกทอรีเอาต์พุต

source: Browse for output directory
th: เรียกดูโฟลเดอร์ผลลัพธ์

source: Browse for directory
th: เรียกดูโฟลเดอร์

source: Invalid value: {0}
th: ค่าไม่ถูกต้อง: {0}

source: When selected, requires PDF version {0} or higher for the output file
th: เมื่อเลือก ต้องใช้ PDF เวอร์ชัน {0} หรือสูงกว่าสำหรับไฟล์เอาต์พุต

source: Right click to add special prefix keywords like timestamp or filename
th: คลิกขวาเพื่อเพิ่มคีย์เวิร์ดนำหน้าพิเศษ เช่น วันที่และเวลา หรือชื่อไฟล์

source: Open the task output file
th: เปิดไฟล์ผลลัพธ์ของงาน

source: Open the task output directory
th: เปิดโฟลเดอร์ผลลัพธ์ของงาน

source: Task footer
th: ส่วนท้ายงาน

source: Task progress
th: ความคืบหน้างาน

source: Task progress: {0}
th: ความคืบหน้าของงาน: {0}

source: Task status: {0}
th: สถานะงาน: {0}

source: Task status: {0}%
th: สถานะงาน: {0}%

source: Split at this size:
ar: مقسمة بهذا الحجم:
lv: Sadalīt pie šī izmēra:

source: Alternate Mix
ar: دمج بالتناوب
lv: Alternatīvs Mikss

source: Rotate
ar: تدوير
lv: Pagriezt

source: Double click to set pages you want to rotate (ex: 2 or 5-23 or 2,5-7,12-)
ar: انقر نقرًا مزدوجًا لتعيين الصفحات التي تريد تدويرها (على سبيل المثال: 2 أو 5-23 أو 2، 5-7، 12-)
lv: Veiciet dubultklikšķi, lai iestatītu lapas, kuras vēlaties pagriezt (piem.: 2 vai 5-23, vai 2,5-7,12-)

source: Pages normalization:
ar: توحيد الصفحات
lv: Lapas normalizācija:

source: Interactive forms (AcroForms):
ar: النماذج التفاعلية (AcroForms):
lv: Interaktīvās veidlapas ('AcroForms'):

source: Bookmarks handling:
ar: التعامل مع الإشارات المرجعية:
lv: Grāmatzīmju pārvaldība:

source: Table of contents:
ar: جدول المحتويات:
lv: Satura rādītājs:

source: Confirm clearing
ar: تأكيد المسح
lv: Apstiprināt notīrīšanu

source: Java runtime path: %s
ar: مسار وقت تشغيل Java: %s
lv: Java izpildlaika ceļš: %s

source: Fork PDFsam on GitHub
ar: افصل نسخة من PDFsam على GitHub
lv: Forkojiet PDFsam pakalpojumā GitHub

source: Log register rows:
ar: صفوف سجل التسجيل
lv: Žurnāla reģistra rindas:

source: Language:
ar: اللغة:
lv: Valoda:

source: Startup tool:
ar: أداة بدء التشغيل:
lv: Palaišanas rīks:

source: Theme:
ar: السمة:
lv: Tēma:

source: Font size:
ar: حجم الخط:
lv: Fonta lielums:

source: Drag and drop PDF files here
ar: اسحب وأفلِت ملفات PDF هنا
lv: Velciet un nometiet PDF failus šeit

source: Double click to set selected pages (ex: 2 or 5-23 or 2,5-7,12-)
ar: انقر نقرًا مزدوجًا لتعيين الصفحات المحددة (على سبيل المثال: 2 أو 5-23 أو 2، 5-7، 12-)
lv: Dubultklikšķis lai iestatītu atlasītās lapas (piem: 2 vai 5-23 vai 2,5-7,12-)

source: Version {0}
ar: الإصدار {0}
lv: Versija {0}

source: Font:
ar: Шрифт:
lv: Fonts:

source: MB
ar: ميغا بايت

source: KB
ar: كيلو بايت
