Repository: Mu-L/pdfsam
Catalog: pdfsam-i18n/po/*.po
Languages: ar, lv, th

source: Select a previously saved workspace that will be automatically loaded at startup
ar: حدد مساحة عمل تم حفظها مسبقًا والتي سيتم تحميلها تلقائيًا عند بدء التشغيل
lv: Izvēlieties iepriekš saglabātu darbvietu kas tiks automātiski ielādēta startējot
th: เลือกพื้นที่ทำงานที่บันทึกไว้ก่อนหน้านี้ซึ่งจะโหลดโดยอัตโนมัติเมื่อเริ่มต้น

source: Select a workspace
ar: حدد مساحة العمل
lv: Izvēlēties darbvietu
th: เลือกพื้นที่ทำงาน

source: Default working directory:
ar: المجلد الافتراضي للعمل:
lv: Noklusējuma darba direktorija:
th: ห้องทำงานปริยาย

source: Load default workspace at startup:
ar: تحميل مساحة العمل الافتراضية عند بدء التشغيل:
lv: Ielādēt noklusējuma darbvietu startējot:
th: โหลดพื้นที่ทำงานเริ่มต้นเมื่อเริ่มต้น:

source: System default
ar: الإعدادات الافتراضية للنظام
lv: Sistēmas noklusējums
th: ค่าเริ่มต้นระบบ

source: Check for updates at startup
ar: التحقق من وجود تحديثات عند بدء التشغيل
lv: Pārbaudīt atjauninājumus startējot
th: เช็คอัพเดตตอนเริ่มโปรแกรม

source: Set whether new version availability should be checked on startup (restart needed)
ar: تعيين ما إذا كان يجب التحقق من توفر الإصدار الجديد عند بدء التشغيل (يلزم إعادة التشغيل)
lv: Iestatīt, vai pārbaudīt jaunas versijas pieejamību startējot (nepieciešama restartēšana)
th: ตั้งค่าว่าควรตรวจสอบความพร้อมใช้งานเวอร์ชันใหม่เมื่อเริ่มต้นระบบ (จำเป็นต้องรีสตาร์ท)

source: Check for news at startup
ar: التحقق من الأخبار عند بدء التشغيل
lv: Pārbaudīt jaunumus startējot
th: ตรวจสอบข่าวสารเมื่อเริ่มต้น

source: Set whether the application should check for news availability on startup (restart needed)
ar: تعيين ما إذا كان يجب على التطبيق التحقق من توفر الأخبار عند بدء التشغيل (يلزم إعادة التشغيل)
lv: Iestatīt, vai lietotne startējot pārbauda ziņu pieejamību (nepieciešama restartēšana)
th: ตั้งค่าว่าแอปพลิเคชันควรตรวจสอบความพร้อมของข่าวสารเมื่อเริ่มต้นระบบ (จำเป็นต้องรีสตาร์ท)

source: Enabled PDF compression
ar: تمكين ضغط PDF
lv: Iespējota PDF kompresija
th: เปิดใช้งานการบีบอัด PDF

source: Set whether "Compress output file" should be enabled by default
ar: تعيين ما إذا كان يجب تمكين "ضغط ملف الإخراج" افتراضيًا
lv: Iestatīt, vai "Saspiest izvades failu" jābūt iespējotam pēc noklusējuma
th: ตั้งค่าว่าควรเปิดใช้งาน "บีบอัดไฟล์เอาต์พุต" โดยค่าเริ่มต้น

source: Overwrite files
ar: الكتابة فوق الملفات
lv: Pārrakstīt failus
th: เขียนทับไฟล์

source: Set whether "Overwrite if already exists" should be enabled by default
ar: تعيين ما إذا كان يجب تمكين "الكتابة فوق إذا كان موجودًا بالفعل" افتراضيًا
lv: Iestatīt, vai "Pārrakstīt, ja jau pastāv" jābūt iespējotam pēc noklusējuma
th: ตั้งค่าว่าควรเปิดใช้งาน "เขียนทับหากมีอยู่แล้ว" โดยค่าเริ่มต้น

source: Play alert sounds
ar: تشغيل أصوات التنبيه
lv: Atskaņot brīdinājuma skaņas
th: เล่นเสียงเตือน

source: Turn on or off alert sounds
ar: تشغيل أو إيقاف أصوات التنبيه
lv: Ieslēgt vai izslēgt brīdinājuma skaņas
th: เปิดหรือปิดเสียงเตือน

source: Store passwords when saving a workspace file
ar: تخزين كلمات المرور عند حفظ ملف مساحة العمل
lv: Saglabāt paroles, saglabājot darbvirsmas failu
th: จัดเก็บรหัสผ่านเมื่อบันทึกไฟล์พื้นที่ทำงาน

source: If an encrypted PDF document has been opened with a password, save the password in the workspace file
ar: إذا تم فتح مستند PDF مشفر بكلمة مرور، فاحفظ كلمة المرور في ملف مساحة العمل
lv: Ja šifrēts PDF dokuments ir atvērts ar paroli, saglabājiet paroli darbvietas failā
th: หากเอกสาร PDF ที่เข้ารหัสถูกเปิดด้วยรหัสผ่านให้บันทึกรหัสผ่านในไฟล์พื้นที่ทำงาน

source: Show donation window
ar: إظهار نافذة التبرع
lv: Rādīt ziedojumu logu
th: แสดงหน้าบริจาค

source: Turn on or off the notification appearing once in a while and asking the user to support PDFsam with a donation
ar: تفعيل أو تعطيل الإشعار الذي يظهر من حين لآخر ويطلب من المستخدم دعم PDFsam بالتبرع
lv: Ieslēgt vai izslēgt paziņojumu kas ik pa laikam parādās un lūdz lietotāju atbalstīt PDFsam ar ziedojumu
th: เปิดหรือปิดการแจ้งเตือนที่ปรากฏเป็นครั้งคราวและขอให้ผู้ใช้สนับสนุน PDFsam ด้วยการบริจาค

source: Show premium features
ar: إظهار الميزات المتميزة
lv: Rādīt premium funkcijas
th: แสดงคุณสมบัติพิเศษ

source: Set whether the application should fetch and show premium features description in the modules dashboard
ar: تحديد ما إذا كان التطبيق سيجلب ويعرض وصفًا للميزات المتميزة في لوحة معلومات الوحدات
lv: Iestatīt, vai lietojumprogramma ielādē un rāda premium funkciju aprakstu moduļu informācijas panelī
th: ตั้งค่าว่าจะให้แอปพลิเคชันดึงข้อมูลและแสดงคำอธิบายคุณลักษณะพิเศษในแผงควบคุมโมดูลหรือไม่

source: Ask for a confirmation when clearing the selection table
ar: اطلب التأكيد عند مسح جدول الاختيار
lv: Lūgt apstiprinājumu notīrot atlases tabulu
th: ขอคำยืนยันเมื่อล้างตารางการเลือก

source: Set whether the application should ask for a confirmation when clearing the selection table
ar: تعيين ما إذا كان يجب على التطبيق أن يطلب تأكيدًا عند مسح جدول التحديد
lv: Iestatīt, vai lietojumprogramma prasa apstiprinājumu, notīrot atlases tabulu
th: ตั้งค่าว่าแอปพลิเคชันควรขอคำยืนยันหรือไม่เมื่อล้างตารางการเลือก

source: Use the selected PDF document directory as output directory
ar: استخدم دليل مستند PDF المحدد كدليل إخراج
lv: Izmantot izvēlēto PDF dokumentu direktoriju kā izvades direktoriju
th: ใช้ไดเร็กทอรีเอกสาร PDF ที่เลือกเป็นไดเร็กทอรีเอาต์พุต

source: Save default workspace on exit
ar: حفظ مساحة العمل الافتراضية عند الخروج
lv: Saglabāt noklusējuma darbvietu izejot
th: บันทึกพื้นที่ทำงานเริ่มต้นเมื่อออก

source: If a default workspace is set, save it on application exit
ar: إذا تم تعيين مساحة عمل افتراضية، فاحفظها عند الخروج من التطبيق
lv: Ja noklusējuma darbvieta ir iestatīta saglabāt to aizverot lietojumprogrammu
th: หากมีการตั้งค่าพื้นที่ทำงานเริ่มต้นให้บันทึกเมื่อออกจากแอปพลิเคชัน

source: Maximum number of rows mast be a positive number
ar: يجب أن يكون الحد الأقصى لعدد الصفوف عددًا موجبًا
lv: Maksimālajam rindu skaitam jābūt pozitīvam skaitlim
th: จำนวนเสาสูงสุดของแถวเป็นจำนวนบวก

source: Summary
ar: ملخص
lv: Kopsavilkums
th: สรุป

source: Keywords
ar: كلمات مفتاحية
lv: Atslēgvārdi
th: คำสำคัญ

source: Document details
ar: تفاصيل الوثيقة
lv: Dokumenta detaļas
th: รายละเอียดเอกสาร

source: Show errors
ar: إظهار الأخطاء
lv: Rādīt kļūdas
th: แสดงข้อผิดพลาดต่าง ๆ

source: Input parameters are invalid
ar: القيم المُدخلة غير صالحة
lv: Ievades parametri ir nederīgi
th: พารามิเตอร์ที่ป้อนไม่ถูกต้อง

source: Invalid parameters
ar: القيم غير صالحة
lv: Nederīgi parametri
th: พารามิเตอร์ไม่ถูกต้อง

source: Access denied
ar: تم رفض الوصول
lv: Piekļuve liegta
th: ถูกปฏิเสธการเข้าใช้งาน

source: Unable to access "{0}", please make sure you have write permissions or open the application messages for details.
ar: تعذر الوصول إلى "{0}"، يرجى التأكد من أن لديك أذونات الكتابة أو فتح رسائل التطبيق للحصول على التفاصيل.
lv: Nevar piekļūt "{0}", lūdzu, pārliecinieties, ka jums ir rakstīšanas atļaujas vai atveriet lietojumprogrammas ziņojumus, lai iegūtu sīkāku informāciju.
th: ไม่สามารถเข้าถึง "{0}" โปรดตรวจสอบว่าคุณมีสิทธิ์ในการเขียนหรือเปิดดูรายละเอียดในข้อความของแอปพลิเคชัน

source: You performed {0} tasks with PDFsam, did it help?
ar: لقد قمت بتنفيذ {0} مهمة باستخدام PDFsam، هل كان ذلك مفيدًا؟
lv: Jūs veicāt {0} uzdevumus ar PDFsam, vai tas palīdzēja?
th: คุณดำเนินการ {0} งานด้วย PDFsam มันช่วยได้ไหม

source: Give something back
ar: أعط شيئا في المقابل
lv: Dod kaut ko atpakaļ
th: ให้บางสิ่งกลับมา

source: PDFsam worked hard!
ar: لقد عمل PDFsam بجد!
lv: PDFsam strādāja cītīgi!
th: PDFsam ทำงานหนักมาก!

source: Spread the word!
ar: نشر الكلمة!
lv: Izplatiet ziņu!
th: บอกต่อ

source: PDFsam {0} is available for download
ar: PDFsam {0} متاح للتنزيل
lv: PDFsam {0} ir pieejams lejupielādei
th: PDFsam {0} มีให้ดาวน์โหลด

source: Download
ar: تحميل
lv: Lejupielādēt
th: ดาวน์โหลด

source: New version available
ar: النسخة الجديدة متاحة
lv: Jauna versija pieejama
th: เวอร์ชันใหม่พร้อมใช้งาน

source: You are running the latest version of PDFsam Basic
ar: أنت تقوم بتشغيل أحدث إصدار من PDFsam Basic
lv: Jums ir jaunākā PDFsam Basic versija
th: คุณกำลังใช้งานเวอร์ชันล่าสุดของ PDFsam Basic

source: No update
ar: لا يوجد تحديث
lv: Nav atjauninājumu
th: ไม่มีการอัปเดต

source: Open
ar: فتح
lv: Atvērt
th: เปิด

source: File "{0}" does not exist or is invalid
ar: الملف "{0}" غير موجود أو غير صالح
lv: Fails "{0}" nepastāv vai ir nederīgs
th: ไฟล์ {0} ไม่มีอยู่จริงหรือไม่ถูกต้อง

source: Valid user password provided.
ar: تم تقديم كلمة مرور مستخدم صالحة.
lv: Derīga lietotāja parole ievadīta.
th: ระบุรหัสผ่านผู้ใช้ถูกต้อง

source: This document is encrypted, click to provide a password.
ar: تم تشفير هذه الوثيقة، انقر هنا لتوفير كلمة المرور.
lv: Šis dokuments ir šifrēts. Noklikšķiniet, lai sniegtu paroli.
th: เอกสารนี้ถูกเข้ารหัส คลิกเพื่อป้อนรหัสผ่าน

source: An error has occurred, click for more details.
ar: لقد حدث خطأ، انقر للحصول على مزيد من التفاصيل.
lv: Radusies kļūda. Noklikšķiniet, lai gūtu vairāk informācijas.
th: เกิดข้อผิดพลาด คลิกเพื่อดูรายละเอียดเพิ่มเติม

source: Split tools
ar: أدوات التقسيم
lv: Sadališanas rīki
th: เครื่องมือแยก

source: Merge tools
ar: أدوات الدمج
lv: Apvienošanas rīki
th: เครื่องมือรวม

source: Convert tools
ar: تحويل الأدوات
lv: Konvertēšanas rīki
th: เครื่องมือแปลง

source: Edit tools
ar: أدوات التحرير
lv: Rediģēšanas rīki
th: เครื่องมือแก้ไข

source: Other tools
ar: أدوات أخرى
lv: Citi rīki
th: เครื่องมืออื่นๆ

source: Checking for updates
ar: التحقق من التحديثات
lv: Pārbauda atjauninājumus
th: กำลังตรวจสอบอัปเดต

source: Unable to find the latest available version.
ar: غير قادر على العثور على الإصدار الأحدث المتاح.
lv: Neizdevās atrast jaunāko pieejamo versiju.
th: ไม่พบเวอร์ชันล่าสุดที่พร้อมใช้งาน

source: Unable to find any valid PDF file in the list: {0}
ar: تعذر العثور على أي ملف PDF صالح في القائمة: {0}
lv: Neizdevās atrast nevienu derīgu PDF failu sarakstā: {0}
th: ไม่พบไฟล์ PDF ที่ถูกต้องใดๆ ในรายการ: {0}

source: Unable to load PDF list file from {0}
ar: غير قادر على تحميل ملف قائمة PDF من {0}
lv: Neizdevās ielādēt PDF saraksta failu no {0}
th: ไม่สามารถโหลดไฟล์รายการ PDF จาก {0}

source: Loading pdf documents
ar: تحميل مستندات pdf
lv: Notiek pdf dokumentu ielāde
th: กำลังโหลดเอกสาร PDF

source: Documents loaded
ar: المستندات المحملة
lv: Dokumenti ielādēti
th: เอกสารโหลดแล้ว

source: Unable to retrieve premium features description
ar: غير قادر على استرداد وصف الميزات المدفوعة
lv: Nevar iegūt premium funkciju aprakstu
th: ไม่สามารถดึงข้อมูลคำอธิบายคุณสมบัติพรีเมียม

source: Fetching premium modules
ar: جلب الوحدات المدفوعة
lv: Iegūst premium moduļus
th: กำลังโหลดโมดูลพรีเมียม

source: Unable to retrieve premium modules
ar: غير قادر على استرداد الوحدات المدفوعة
lv: Nevarēja iegūt premium moduļus
th: ไม่สามารถดึงข้อมูลโมดูลพรีเมียมได้

source: Unable to retrieve latest news
ar: غير قادر على استرجاع آخر الأخبار
lv: Nevarēja ielādēt jaunākās ziņas
th: ไม่สามารถดึงข่าวสารล่าสุดได้

source: Fetching latest news
ar: جلب آخر الأخبار
lv: Iegūst jaunākās ziņas
th: กำลังดึงข้อมูลข่าวสารล่าสุด

source: Unable to retrieve the latest news
ar: غير قادر على استرجاع آخر الأخبار
lv: Nevarēja ielādēt jaunākās ziņas
th: ไม่สามารถดึงข่าวสารล่าสุดได้

source: Saving workspace data to {0}
ar: حفظ بيانات مساحة العمل في {0}
lv: Saglabā darbvietas datus uz {0}
th: กำลังบันทึกข้อมูลพื้นที่ทำงานไปยัง {0}

source: Workspace saved
ar: تم حفظ مساحة العمل
lv: Darbvieta saglabāta
th: พื้นที่ทำงานบันทึกแล้ว

source: Requesting modules state
ar: طلب حالة الوحدات
lv: Moduļu stāvokļa pieprasīšana
th: กำลังร้องขอสถานะโมดูล

source: Unable to save workspace to {0}
ar: غير قادر على حفظ مساحة العمل إلى {0}
lv: Nevar saglabāt darbvietu uz {0}
th: ไม่สามารถบันทึกเวิร์กสเปซที่ {0}

source: Loading workspace from {0}
ar: تحميل مساحة العمل من {0}
lv: Notiek darbvietas ielāde no {0}
th: กำลังโหลดพื้นที่ทำงานจาก {0}

source: Unable to load workspace from {0}
ar: غير قادر على تحميل مساحة العمل من {0}
lv: Neizdevās ielādēt darbvietu no {0}
th: ไม่สามารถโหลดเวิร์กสเปซจาก {0}

source: Light with blue
ar: فاتح مع أزرق
lv: Gaišs ar zilu
th: โทนสว่างสีน้ำเงิน

source: Dark with purple
ar: مظلم مع أرجواني
lv: Tumšs ar violetu
th: เข้มกับม่วง

source: Dark with teal
ar: مظلم مع أزرق مخضر
lv: Tumšs ar tirkīzzilu
th: เข้มกับเขียวอมน้ำเงิน

source: Light with maroon
ar: فاتح مع كستنائي
lv: Gaišs ar bordo
th: อ่อนกับมารูน

source: Close
ar: إغلاق
lv: Aizvērt
th: ปิด

source: The selected PDF document is invalid
ar: مستند PDF المحدد غير صالح
lv: Izvēlētais PDF dokuments ir nederīgs
th: เอกสาร PDF ที่เลือกไม่ถูกต้อง

source: Select the PDF file
ar: حدد ملف PDF
lv: Izvēlēties PDF failu
th: เลือกไฟล์ PDF

source: _Select PDF
ar: _حدد ملف PDF
lv: _Atlasīt PDF
th: _เลือก PDF

source: Pages: {0}, PDF Version: {1}
ar: الصفحات: {0}، نسخة PDF: {1}
lv: Lapas: {0}, PDF versija: {1}
th: หน้า: {0}, เวอร์ชัน PDF: {1}

source: Loading...
ar: جار التحميل...
lv: Ielādē...
th: กำลังทำการโหลด...

source: Document properties
ar: خصائص المستند
lv: Dokumenta īpašības
th: คุณสมบัติเอกสาร

source: Remove
ar: إزالة
lv: Aizvākt
th: ลบออก

source: Set destination
ar: تعيين الوجهة
lv: Iestatīt galamērķi
th: กำหนดปลายทาง

source: Open Folder
ar: فتح المجلد
lv: Atvērt Mapi
th: เปิดโฟลเดอร์

source: Enter the user password
ar: أدخل كلمة مرور المستخدم
lv: Ievadiet lietotāja paroli
th: ป้อนรหัสผ่านผู้ใช้

source: Unlock
ar: إلغاء القفل
lv: Atslēgt
th: ปลดล็อก

source: Set as range for all
ar: تعيين كنطاق للجميع
lv: Iestatīt par diapazonu visiem
th: กำหนดเป็นช่วงสำหรับทั้งหมด

source: Move to Top
ar: انتقل إلى الأعلى
lv: Pārvietot uz augšu
th: ย้ายไปด้านบน

source: Move Up
ar: تحرك للأعلى
lv: Pārvietot uz augšu
th: เลื่อนขึ้น

source: Move Down
ar: التحرك للأسفل
lv: Pārvietot lejup
th: เลื่อนลง

source: Move to Bottom
ar: الانتقال إلى الأسفل
lv: Pārvietot uz apakšu
th: ย้ายไปด้านล่าง

source: Duplicate
ar: تكرار
lv: Dublēt
th: ทำซ้ำ

source: Selected pages
ar: الصفحات المختارة
lv: Izvēlētās lapas
th: หน้าที่เลือก

source: Total number of selected pages
ar: إجمالي عدد الصفحات المحددة
lv: Kopējais atlasīto lapu skaits
th: จำนวนหน้าที่เลือกทั้งหมด

source: Size
ar: حجم
lv: Izmērs
th: ขนาด

source: Modified
ar: معدّل
lv: Modificēts
th: ถูกแก้ไข

source: Total pages: {0}
ar: إجمالي الصفحات: {0}
lv: Kopā lapas: {0}
th: รวมหน้า: {0}

source: Name
ar: إسم
lv: Nosaukums
th: ชื่อ

source: Add documents to the table
ar: إضافة المستندات إلى الجدول
lv: Pievienot dokumentus tabulai
th: เพิ่มเอกสารลงในตาราง

source: _Add
ar: _أضف
lv: _Pievienot
th: _เพิ่ม

source: PDF list from _text/csv file
ar: قائمة PDF من ملف _text/csv
lv: PDF saraksts no _teksta/csv faila
th: รายการ PDF จากไฟล์ _text / csv

source: Select pdf documents to load
ar: حدد مستندات pdf لتحميلها
lv: Izvēlēties PDF dokumentus ielādēšanai
th: เลือกเอกสาร pdf ที่จะโหลด

source: Select a text or CSV file to load
ar: حدد ملف نصي أو ملف CSV لتحميله
lv: Izvēlieties teksta vai CSV failu ielādēšanai
th: เลือกข้อความหรือไฟล์ CSV ที่จะโหลด

source: Removes selected documents
ar: إزالة المستندات المحددة
lv: Noņem atlasītos dokumentus
th: ลบเอกสารที่เลือก

source: _Remove
ar: _إزالة
lv: _Noņemt
th: เอาออก

source: Removes every document
ar: إزالة كل المستندات
lv: Noņem visus dokumentus
th: ลบเอกสารทุกฉบับ

source: C_lear all settings
ar: م_سح جميع الإعدادات
lv: N_otīrīt visus iestatījumus
th: C_lear การตั้งค่าทั้งหมด

source: Moves up selected documents
ar: نقل المستندات المحددة لأعلى
lv: Pārvietot uz augšu atlasītos dokumentus
th: ย้ายเอกสารที่เลือกขึ้น

source: Move _Up
ar: تحرك لأعلى
lv: Pārvietot _Uz augšu
th: ขยับขึ้น

source: Moves down selected documents
ar: نقل المستندات المحددة إلى الأسفل
lv: Pārvieto uz leju atlasītos dokumentus
th: ย้ายเอกสารที่เลือกลง

source: Move _Down
ar: نقل إلى الأسفل
lv: Pārvietot uz _leju
th: เลื่อน_ลง

source: Pace
ar: خطوة
lv: Temps
th: ก้าว

source: Double click to set the number of pages after which the task will switch to the next file
ar: انقر نقرًا مزدوجًا لتعيين عدد الصفحات التي ستنتقل بعدها المهمة إلى الملف التالي
lv: Dubultklikšķiniet, lai iestatītu lapu skaitu, pēc kura uzdevums pārslēgsies uz nākamo failu
th: ดับเบิลคลิกเพื่อกำหนดจำนวนหน้าหลังจากนั้นงานจะเปลี่ยนไปยังไฟล์ถัดไป

source: Reverse
ar: اعكس
lv: Apgriezt
th: ย้อนกลับ

source: Pages
ar: الصفحات
lv: Lapas
th: หน้า

source: Number of total pages of the document
ar: عدد الصفحات الاجمالية للوثيقة
lv: Dokumenta kopējais lapu skaits
th: จำนวนหน้าทั้งหมดของเอกสาร

source: Page ranges
ar: نطاقات الصفحات
lv: Lapu diapazoni
th: ช่วงหน้า

source: Select a file
ar: حدد ملفًا
lv: Izvēlēties failu
th: เลือกไฟล์

source: The selected file must exist.
ar: يجب أن يكون الملف المحدد موجودًا.
lv: Izvēlētajam failam ir jāeksistē.
th: ไฟล์ที่เลือกต้องมีอยู่

source: Allowed extensions are {0}
ar: الامتدادات المسموح بها هي {0}
lv: Atļautie paplašinājumi ir {0}
th: ส่วนขยายที่อนุญาตคือ {0}

source: Compress output file/files
ar: ضغط ملف/ملفات الإخراج
lv: Saspiest izejošo failu/failus
th: บีบอัดไฟล์ที่ทำเสร็จแล้ว

source: Tick the box if you don't want to retain any bookmark from the original PDF document
ar: قم بتحديد المربع إذا كنت لا تريد الاحتفاظ بأي إشارة مرجعية من مستند PDF الأصلي
lv: Atzīmējiet rūtiņu, ja nevēlaties saglabāt nevienu grāmatzīmi no oriģinālā PDF dokumenta
th: เลือกช่องนี้หากคุณไม่ต้องการคงที่คั่นหน้าไว้จากเอกสาร PDF ต้นฉบับ

source: Output PDF version:
ar: نسخة PDF الإخراجية:
lv: Izvades PDF versija:
th: เวอร์ชัน PDF เอาต์พุต:

source: Show advanced settings
ar: إظهار الإعدادات المتقدمة
lv: Rādīt papildu iestatījumus
th: แสดงการตั้งค่าขั้นสูง

source: Hide advanced settings
ar: إخفاء الإعدادات المتقدمة
lv: Slēpt izvērstos iestatījumus
th: ซ่อนการตั้งค่าขั้นสูง

source: Overwrite if already exists
ar: الكتابة فوق إذا كان موجودًا بالفعل
lv: Pārrakstīt ja jau eksistē
th: เขียนทับไฟล์เดิม

source: Tick the box if you want to overwrite the output files if they already exist.
ar: قم بتحديد المربع إذا كنت تريد استبدال ملفات الإخراج إذا كانت موجودة بالفعل.
lv: Atzīmējiet lodziņu, ja vēlaties pārrakstīt izvades failus, ja tie jau pastāv.
th: ทำเครื่องหมายในช่องหากคุณต้องการเขียนทับไฟล์เอาต์พุตหากมีอยู่แล้ว

source: Same as the input document
ar: نفس مستند الإدخال
lv: Tāds pats kā ievaddokuments
th: เช่นเดียวกับเอกสารต้นฉบับ

source: An existing output directory is required
ar: مطلوب مجلد إخراج موجود
lv: Esoša izvades direktorija ir nepieciešama
th: ต้องระบุโฟลเดอร์ปลายทางที่มีอยู่

source: The output directory is required
ar: مطلوب مجلد الإخراج
lv: Izvades direktorijs ir obligāts
th: ต้องระบุโฟลเดอร์ปลายทาง

source: Select an existing directory
ar: حدد مجلدا موجودًا
lv: Atlasīt esošu mapi
th: เลือกโฟลเดอร์ที่มีอยู่

source: Select
ar: تحديد
lv: Atlasīt
th: เลือก

source: Browse
ar: تصفّح
lv: Pārlūkot
th: เรียกดู

source: PDF version required: {0}
ar: نسخة PDF المطلوبة: {0}
lv: PDF versija nepieciešama: {0}
th: จำเป็นต้องใช้ PDF เวอร์ชัน: {0}

source: Prefix for the generated files names
ar: البادئة لأسماء الملفات المُنشأة
lv: Prefikss ģenerēto failu nosaukumiem
th: คำนำหน้าสำหรับชื่อไฟล์ที่สร้างขึ้น

source: Add prefix
ar: إضافة البادئة
lv: Pievienot prefiksu
th: เพิ่มคำนำหน้า

source: DEFAULT_PREFIX
lv: NOKLUSĒJUMA_PREFIKSS
th: ค่าเริ่มต้นคำนำหน้า

source: Generated PDF documents name prefix:
ar: بادئة اسم مستندات PDF المُنشأة:
lv: Ģenerēto PDF dokumentu nosaukuma priedēklis:
th: คำนำหน้าชื่อไฟล์ PDF ที่สร้าง:

source: Prefix for the output files name.
ar: بادئة اسم ملفات الإخراج.
lv: Izvades failu nosaukuma prefikss.
th: คำนำหน้าชื่อไฟล์ผลลัพธ์

source: Some special keywords are replaced with runtime values.
ar: يتم استبدال بعض الكلمات الرئيسية الخاصة بقيم وقت التشغيل.
lv: Daži īpaši atslēgvārdi tiek aizstāti ar izpildlaika vērtībām.
th: คำสำคัญพิเศษบางคำจะถูกแทนที่ด้วยค่ารันไทม์

source: Right click to add these keywords.
ar: انقر بزر الماوس الأيمن لإضافة هذه الكلمات المفتاحية.
lv: Labais klikšķis, lai pievienotu šos atslēgvārdus.
th: คลิกขวาเพื่อเพิ่มคำสำคัญเหล่านี้

source: Run
ar: تشغيل
lv: Palaist
th: เรียกใช้งาน

source: Run the task
ar: تشغيل المهمة
lv: Palaist uzdevumu
th: เรียกใช้งาน

source: Requested
ar: مطلوب
lv: Pieprasīts
th: ร้องขอ

source: Completed
ar: مكتمل
lv: Pabeigts
th: เสร็จสมบูรณ์

source: Failed
ar: فشل
lv: Neizdevās
th: ล้มเหลว

source: Running
ar: جري
lv: Darbojas
th: กำลังทำงาน

source: Running {0}%
ar: الجري {0}%
lv: Darbojas {0}%
th: กำลังทำงาน {0}%

source: Invalid range: {0}.
ar: نطاق غير صالح: {0}.
lv: Nederīgs diapazons: {0}.
th: ช่วงไม่ถูกต้อง: {0}

source: Ambiguous page range definition: {0}. Use following formats: [n] or [n1-n2] or [-n] or [n-]
ar: تعريف نطاق الصفحات الغامض: {0}. استخدم التنسيقات التالية: [n] أو [n1-n2] أو [-n] أو [n-]
lv: Pārprotama lappušu diapazona definīcija: {0}. Lūdzu, izmantojiet kādu no šiem formātiem: [n] vai [n1-n2], vai [-n], vai [n-]
th: การกำหนดช่วงหน้าไม่ชัดเจน: {0} ใช้รูปแบบต่อไปนี้: [n] หรือ [n1-n2] หรือ [-n] หรือ [n-]

source: Invalid number: {0}.
ar: رقم غير صالح: {0}.
lv: Nederīgs skaitlis: {0}.
th: ตัวเลขไม่ถูกต้อง: {0}.

source: Pages to extract (ex: 2 or 5-23 or 2,5-7,12- or 3,last)
ar: الصفحات المراد استخراجها (على سبيل المثال: 2 أو 5-23 أو 2، 5-7، 12- أو 3، الأخيرة)
lv: Lapas, ko izvilkt (piem.: 2 vai 5-23 vai 2,5-7,12- vai 3,pēdējā)
th: หน้าที่จะแยก (เช่น: 2 หรือ 5-23 หรือ 2,5-7,12- หรือ 3,สุดท้าย)

source: Comma separated page numbers or ranges to extract (ex: 2 or 5-23 or 2,5-7,12- or 3,last)
ar: أرقام الصفحات أو النطاقات التي يجب استخراجها مفصولة بفواصل (على سبيل المثال: 2 أو 5-23 أو 2، 5-7، 12- أو 3، الأخير)
lv: Ar komatiem atdalīti lapu numuri vai diapazoni izvilkšanai (piemēram: 2 vai 5-23 vai 2,5-7,12- vai 3,pēdējā)
th: หมายเลขหน้าหรือช่วงที่คั่นด้วยจุลภาคเพื่อแยก (ตัวอย่าง: 2 หรือ 5-23 หรือ 2,5-7,12- หรือ 3,สุดท้าย)

source: Merge multiple PDF documents or subsections of them.
ar: دمج مستندات PDF متعددة أو أقسام فرعية منها.
lv: Apvienot vairākus PDF dokumentus vai to apakšsekcijas.
th: รวมเอกสาร PDF หลายฉบับ หรือส่วนย่อยของเอกสารเหล่านั้น

source: A .pdf extension is required for the repeating file
ar: يجب أن يكون الامتداد .pdf مطلوبًا للملف المتكرر
lv: Dublētajam failam ir nepieciešams .pdf paplašinājums
th: นามสกุล .pdf จำเป็นสำหรับไฟล์ที่ซ้ำกัน

source: A .pdf destination file extension is required
ar: يجب أن يكون امتداد الملف الوجهة .pdf
lv: Ir nepieciešams .pdf mērķa faila paplašinājums
th: ไฟล์ปลายทางต้องมีนามสกุล .pdf

source: Default PDF version:
ar: نسخة PDF الافتراضية:
lv: Noklusējuma PDF versija:
th: เวอร์ชัน PDF เริ่มต้น:

source: Default PDF version for generated PDF files
ar: إصدار PDF الافتراضي للملفات التي يتم إنشاؤها
lv: Noklusējuma PDF versija ģenerētajiem PDF failiem
th: เวอร์ชัน PDF เริ่มต้นสำหรับไฟล์ PDF ที่สร้างขึ้น

source: Default prefix:
ar: البادئة الافتراضية:
lv: Noklusējuma prefikss:
th: คำนำหน้าเริ่มต้น:

source: Default prefix for output file names, used in tools that generate multiple files
ar: البادئة الافتراضية لأسماء ملفات الإخراج، المستخدمة في الأدوات التي تولد ملفات متعددة
lv: Noklusējuma prefikss izvades failu nosaukumiem, izmantots rīkos, kas ģenerē vairākus failus
th: คำนำหน้าเริ่มต้นสำหรับชื่อไฟล์ผลลัพธ์ ใช้ในเครื่องมือที่สร้างไฟล์หลายไฟล์

source: Set whether "Discard bookmarks" should be enabled by default
ar: تعيين ما إذا كان يجب تمكين "تجاهل الإشارات المرجعية" افتراضيًا
lv: Iestatīt, vai "Atmest grāmatzīmes" jābūt iespējotam pēc noklusējuma
th: ตั้งค่าให้ "ทิ้งบุ๊กมาร์ก" เปิดใช้งานโดยค่าเริ่มต้น

source: Workspace loaded: {0}
ar: مساحة العمل المحملة: {0}
lv: Darbvieta ielādēta: {0}
th: พื้นที่ทำงานโหลดแล้ว: {0}

source: The following file already existed and was skipped: {0}
ar: الملف التالي موجود بالفعل وتم تخطيه: {0}
lv: Šis fails jau eksistēja un tika izlaists: {0}
th: ไฟล์ต่อไปนี้มีอยู่แล้วและถูกข้ามไป: {0}

source: Duplicate at Top
ar: مكرر في الأعلى
lv: Dublēt augšpusē
th: ทำซ้ำด้านบน

source: Duplicate Up
ar: مكرر لأعلى
lv: Dublēt uz augšu
th: ทำซ้ำขึ้น

source: Duplicate Down
ar: تكرار لأسفل
lv: Dublēt uz leju
th: ทำซ้ำลง

source: Duplicate at Bottom
ar: مكرر في الأسفل
lv: Dublēt apakšā
th: ทำซ้ำที่ด้านล่าง

source: Error saving content to file {0}
ar: حدث خطأ أثناء حفظ المحتوى في الملف {0}
lv: Kļūda saglabājot saturu failā {0}
th: ข้อผิดพลาดในการบันทึกเนื้อหาลงในไฟล์ {0}
