Repository: Mu-L/pdfsam
Catalog: pdfsam-i18n/po/*.po
Languages: ar, lv, th

source: No PDF document has been selected
ar: لم يتم تحديد أي وثيقة PDF
lv: Neviens PDF dokuments nav atlasīts
th: ไม่ได้เลือกเอกสาร PDF

source: Extract
ar: استخرج
lv: Izvilkt
th: แตกไฟล์

source: Extract pages from PDF documents.
ar: استخرج صفحات من وثائق PDF
lv: Izvilkt lappuses no PDF dokumentiem.
th: แยกหน้าจากเอกสาร PDF.

source: File names settings
ar: إعدادات أسماء الملفات
lv: Datņu nosaukumu iestatījumi
th: การตั้งค่าชื่อไฟล์

source: Extract settings
ar: إعدادات الاستخراج
lv: Izvilkšanas iestatījumi
th: แยกการตั้งค่า

source: Output settings
ar: إعدادات الإخراج
lv: Izvades iestatījumi
th: การตั้งค่าเอาต์พุต

source: A separate file for each set of pages
ar: ملف منفصل لكل مجموعة من الصفحات
lv: Atsevišķs fails katrai lapu kopai
th: หนึ่งไฟล์ต่อหนึ่งชุดหน้า

source: Each continuous series of pages will generate a separate PDF file
ar: كل سلسلة متصلة من الصفحات ستولد ملف PDF منفصل
lv: Katra nepārtraukta lappušu sērija ģenerēs atsevišķu PDF failu
th: ชุดหน้าต่อเนื่องแต่ละชุดจะสร้างไฟล์ PDF แยกต่างหาก

source: Invalid page ranges
ar: نطاقات الصفحات غير صالحة
lv: Nederīgi lappušu diapazoni
th: ช่วงของหน้าไม่ถูกต้อง

source: Extract pages:
ar: استخراج صفحات
lv: Izvilkt lappuses:
th: แยกหน้า:

source: Split by bookmarks
ar: تقسيم حسب الإشارات المرجعية
lv: Sadalīt pēc grāmatzīmēm
th: แยกตามบุ๊กมาร์ก

source: Split a PDF document at bookmarked pages by specifying a bookmark level.
ar: تقسيم مستند PDF إلى صفحات مرجعية عن طريق تحديد مستوى الإشارة المرجعية.
lv: Sadalīt PDF dokumentu pēc grāmatzīmētām lapām, norādot grāmatzīmes līmeni.
th: แยกเอกสาร PDF ตามหน้าบุ๊กมาร์กโดยระบุระดับบุ๊กมาร์ก

source: Regular expression the bookmark has to match
ar: تعبير نمطي يجب أن يطابقه الإشارة المرجعية
lv: Regulārā izteiksme grāmatzīmes atbilstībai
th: นิพจน์ปรกติที่บุ๊กมาร์กต้องตรงกัน

source: Split at this bookmark level:
ar: قسّم عند هذا المستوى من الإشارة المرجعية:
lv: Sadalīt pie šī grāmatzīmes līmeņa:
th: แยกที่ระดับบุ๊กมาร์กนี้:

source: Matching regular expression:
ar: التعبير النمطي المطابق:
lv: Atbilstošā regulārā izteiksme:
th: นิพจน์ปรกติที่ตรงกัน:

source: A regular expression the bookmark text has to match
ar: تعبير نمطي يجب أن يطابق نص الإشارة المرجعية
lv: Regulārā izteiksme, kurai jāatbilst grāmatzīmes tekstam
th: นิพจน์ปรกติที่ข้อความบุ๊กมาร์กต้องตรงตาม

source: Example: use .*Chapter.* to match bookmarks containing the word "Chapter"
ar: مثال: استخدم .*Chapter.* لمطابقة الإشارات المرجعية التي تحتوي على الكلمة "Chapter"
lv: Piemērs: izmantojiet .*Chapter.*, lai atrastu grāmatzīmes, kas satur vārdu "Chapter"
th: ตัวอย่าง: ใช้ .*Chapter.* เพื่อจับคู่บุ๊กมาร์กที่มีคำว่า "Chapter"

source: Select or drag and drop the PDF you want to split
ar: حدد أو اسحب وأفلِت ملف PDF الذي تريد تقسيمه
lv: Atlasiet vai ievelciet PDf dokumentu, ko vēlaties sadalīt
th: เลือกหรือลากและวางไฟล์ PDF ที่คุณต้องการแยก

source: Split settings
ar: إعدادات التقسيم
lv: Dalīšanas iestatījumi
th: การตั้งค่าแยก

source: Invalid bookmarks level
ar: مستوى الإشارات المرجعية غير صالح
lv: Nepareizs grāmatzīmju līmenis
th: ระดับบุ๊กมาร์กไม่ถูกต้อง

source: Split after
ar: قسّم بعد
lv: Dalīt pēc
th: แยกหลัง

source: No page selected
ar: لم يتم تحديد أي صفحة
lv: Nav atlasītu lapu
th: ไม่ได้เลือกหน้า

source: Split
ar: تقسيم
lv: Dalīt
th: แยก

source: Split a PDF document at the given page numbers.
ar: تقسيم مستند PDF عند أرقام الصفحات المحددة.
lv: Sadalīt PDF dokumentu norādītajos lapu numuros.
th: แยกเอกสาร PDF ตามหมายเลขหน้าที่ระบุ

source: Every page
ar: كل صفحة
lv: Katru lapu
th: ทุกหน้า

source: Even pages
ar: الصفحات الزوجية
lv: Pāra lapas
th: หน้าคู่

source: Odd pages
ar: الصفحات الفردية
lv: Nepāra lapas
th: หน้าคี่

source: Split the document after the given page numbers
ar: تقسيم المستند بعد أرقام الصفحات المحددة
lv: Dalīt dokumentu pēc norādītajiem lapu numuriem
th: แยกเอกสารหลังหมายเลขหน้าที่กำหนด

source: Splits the PDF every "n" pages creating documents of "n" pages each
ar: يقسّم ملف PDF كل 'n' صفحات، مُنشئًا ملفات مكوّنة من 'n' صفحات لكلٍ منها
lv: Dalīt PDF dokumentu ik pēc n lapām, veidojot n lapu garus dokumentus
th: แยกไฟล์ PDF ทุก "n" หน้า สร้างเอกสารแต่ละไฟล์มี "n" หน้า

source: Split after the following page numbers
ar: تقسيم بعد أرقام الصفحات التالية
lv: Sadalīt pēc sekojošajiem lapu numuriem
th: แยกหลังหมายเลขหน้าต่อไปนี้

source: Page numbers to split at (n1,n2,n3..)
ar: أرقام الصفحات التي سيتم تقسيمها عند (n1، n2، n3..)
lv: Lapu numuri, pēc kuriem veidot dalījumu (n1,n2,n3...)
th: หมายเลขหน้าสำหรับแยก (n1,n2,n3..)

source: Invalid page numbers
ar: أرقام الصفحات غير صالحة
lv: Nederīgi lapu numuri
th: หมายเลขหน้าไม่ถูกต้อง

source: Only valid positive page numbers are allowed
ar: يُسمح فقط بأرقام الصفحات الإيجابية الصالحة
lv: Atļauti tikai derīgi pozitīvi lapu numuri
th: อนุญาตเฉพาะหมายเลขหน้าจำนวนเต็มบวกที่ถูกต้อง

source: Split by every "n" pages
ar: قسّم كل 'n' صفحات
lv: Sadalīt ik "n" lappusēm
th: แยกทุกๆ "n" หน้า

source: Number of pages
ar: عدد الصفحات
lv: Lapu skaits
th: จำนวนหน้า

source: Invalid number of pages
ar: عدد غير صالح من الصفحات
lv: Nederīgs lapu skaits
th: จำนวนหน้าไม่ถูกต้อง

source: Megabytes
ar: ميغا بايت
lv: Megabaiti
th: เมกะไบต์

source: Kilobytes
ar: كيلو بايت
lv: Kilobaiti
th: กิโลไบต์

source: Split by size
ar: مقسمة حسب الحجم
lv: Sadalīt pēc izmēra
th: แยกตามขนาด

source: Split a PDF document in files of the given size (roughly).
ar: تقسيم مستند PDF إلى ملفات بالحجم المحدد (تقريبًا).
lv: Sadalīt PDF dokumentu failos norādītajā izmērā (aptuveni).
th: แยกเอกสาร PDF เป็นไฟล์ตามขนาดที่กำหนด (โดยประมาณ)

source: Set the size to split at
ar: تعيين الحجم الذي تريد تقسيمه
lv: Iestatīt izmēru, pie kura sadalīt
th: ตั้งค่าขนาดที่จะแบ่ง

source: Size must be a number
ar: يجب أن يكون الحجم رقمًا
lv: Izmēram jābūt skaitlim
th: ขนาดต้องเป็นตัวเลข

source: Invalid split size
ar: حجم تقسيم غير صالح
lv: Nederīgs sadalīšanas izmērs
th: ขนาดไฟล์ที่แยกผิดพลาด

source: Destination file
ar: ملف الوجهة
lv: Mērķa datne
th: ไฟล์ปลายทาง

source: Merge two or more PDF documents taking pages alternately in natural or reverse order.
ar: دمج مستندين PDF أو أكثر من خلال أخذ الصفحات بالتناوب بالترتيب الطبيعي أو العكسي.
lv: Apvienot divus vai vairāk PDF dokumentus, ņemot lapas pamīšus dabiskā vai apgrieztā secībā.
th: รวมเอกสาร PDF สองฉบับขึ้นไป โดยสลับหน้าตามลำดับปกติหรือย้อนกลับ

source: Double click to set pages you want to mix (ex: 2 or 5-23 or 2,5-7,12-)
ar: انقر نقرًا مزدوجًا لتعيين الصفحات التي تريد مزجها (على سبيل المثال: 2 أو 5-23 أو 2،5-7،12-)
lv: Dubultklikšķis, lai iestatītu lapas, kuras vēlaties sajaukt (piem: 2 vai 5-23 vai 2,5-7,12-)
th: ดับเบิลคลิกเพื่อกำหนดหน้าที่คุณต้องการรวม (เช่น: 2 หรือ 5-23 หรือ 2,5-7,12-)

source: Select a positive integer number as pace
ar: حدد عددًا صحيحًا موجبًا للسرعة
lv: Izvēlieties pozitīvu veselu skaitli par tempu
th: เลือกจำนวนเต็มบวกเป็นค่าก้าว

source: All pages
ar: جميع الصفحات
lv: Visas lapas
th: ทุกหน้า

source: 90 degrees clockwise
ar: 90 درجة في اتجاه عقارب الساعة
lv: 90 grādi pulksteņrādītāja virzienā
th: 90 องศาตามเข็มนาฬิกา

source: 180 degrees clockwise
ar: 180 درجة في اتجاه عقارب الساعة
lv: 180 grādi pulksteņrādītāja virzienā
th: 180 องศาตามเข็มนาฬิกา

source: 90 degrees counterclockwise
ar: 90 درجة عكس اتجاه عقارب الساعة
lv: 90 grādi pretēji pulksteņrādītāja virzienam
th: 90 องศา ทวนเข็มนาฬิกา

source: Rotate settings
ar: تدوير الإعدادات
lv: Rotācijas iestatījumi
th: ตั้งค่าการหมุน

source: Rotate
ar: تدوير
lv: Rotēt
th: หมุน

source: Rotate the pages of multiple PDF documents.
ar: تدوير صفحات مستندات PDF المتعددة.
lv: Pagriezt vairāku PDF dokumentu lapas.
th: หมุนหน้าของเอกสาร PDF หลายฉบับ

source: Merge settings
ar: دمج الإعدادات
lv: Apvienošanas iestatījumi
th: ตั้งค่าการผสาน

source: Double click to set pages you want to merge (ex: 2 or 5-23 or 2,5-7,12-)
ar: انقر نقرًا مزدوجًا لتعيين الصفحات التي تريد دمجها (على سبيل المثال: 2 أو 5-23 أو 2، 5-7، 12-)
lv: Veiciet dubultklikšķi, lai iestatītu lappuses, kuras vēlaties apvienot (piem.: 2 vai 5-23, vai 2,5-7,12-)
th: ดับเบิลคลิกเพื่อกำหนดหน้าที่คุณต้องการรวม (เช่น: 2 หรือ 5-23 หรือ 2,5-7,12-)

source: Add a blank page if page number is odd
ar: أضف صفحة فارغة إذا كان رقم الصفحة فرديًا
lv: Pievienot tukšu lapu, ja lappušu skaits ir nepāra
th: เพิ่มหน้าว่างถ้าเลขหน้าเป็นเลขคี่

source: Adds a blank page after each merged document if the document has an odd number of pages
ar: إضافة صفحة فارغة بعد كل مستند مدمج إذا كان المستند يحتوي على عدد فردي من الصفحات
lv: Pievienot tukšu lapu pēc katra apvienotā dokumenta tad, ja šim dokumentam ir nepāra skaits lappušu
th: เพิ่มหน้าว่างหลังเอกสารที่ผสานแต่ละฉบับ หากเอกสารมีจำนวนหน้าเป็นเลขคี่

source: Add a footer
ar: إضافة تذييل
lv: Pievienot kājeni
th: เพิ่มส่วนท้ายกระดาษ

source: Adds a page footer with the name of the file the page belonged to.
ar: إضافة تذييل للصفحة يتضمن اسم الملف الذي تنتمي إليه الصفحة.
lv: Pievieno lapas kājeni ar faila nosaukumu, kuram lapa piederēja.
th: เพิ่มส่วนท้ายหน้าพร้อมชื่อไฟล์ที่หน้านั้นเป็นของ

source: None
ar: لا شيء
lv: Neviens
th: ไม่มี

source: Same width as first page
ar: نفس عرض الصفحة الأولى
lv: Vienāds platums kā pirmajai lapai
th: ความกว้างเท่าหน้าแรก

source: Same width as first page (based on page orientation)
ar: نفس عرض الصفحة الأولى (بناءً على اتجاه الصفحة)
lv: Vienāds platums kā pirmajai lapai (pamatojoties uz lapas orientāciju)
th: ความกว้างเท่าหน้าแรก (อิงตามการวางแนวหน้ากระดาษ)

source: Set whether pages should be resized to all have the same width as the first one
ar: تعيين ما إذا كان يجب تغيير حجم الصفحات بحيث يكون لجميعها نفس عرض الصفحة الأولى
lv: Iestatīt vai lapas jāpielāgo lai visām būtu vienāds platums ar pirmo
th: ตั้งค่าว่าจะปรับขนาดหน้าให้มีความกว้างเท่ากันทั้งหมดกับหน้าแรก

source: Merge fields
ar: دمج الحقول
lv: Apvienot laukus
th: ผสานเขตข้อมูล

source: Merge renaming existing fields
ar: دمج مع إعادة تسمية الحقول الموجودة
lv: Apvienot pārdēvējot esošos laukus
th: รวมเปลี่ยนชื่อฟิลด์ที่มีอยู่

source: Flatten
ar: تسطيح
lv: Saplacināt
th: รวม

source: Discard forms
ar: التخلص من النماذج
lv: Atmest veidlapas
th: ทิ้งแบบฟอร์ม

source: What to do in case one or more input documents contain Acro Forms
ar: ما يجب فعله في حالة احتواء مستند إدخال واحد أو أكثر على نماذج Acro
lv: Ko darīt, ja kāds no ievades dokumentiem satur 'Acro Forms'
th: จะทำอย่างไรในกรณีที่เอกสารนำเข้าตั้งแต่หนึ่งฉบับขึ้นไปมี Acro Forms

source: Retain bookmarks
ar: الاحتفاظ بالإشارات المرجعية
lv: Paturēt grāmatzīmes
th: คงบุ๊กมาร์ก

source: Discard bookmarks
ar: التخلص من العلامات المرجعية
lv: Atmest grāmatzīmes
th: ยกเลิกบุ๊กมาร์ก

source: Create one entry for each merged document
ar: إنشاء إدخال واحد لكل مستند مدمج
lv: Izveidot vienu ierakstu katram apvienotajam dokumentam
th: สร้างหนึ่งรายการสำหรับเอกสารที่ผสานแต่ละฉบับ

source: Retain bookmarks as one entry for each merged document
ar: الاحتفاظ بالإشارات المرجعية كمدخل واحد لكل مستند مدمج
lv: Paturēt grāmatzīmes kā vienu ierakstu katram apvienotajam dokumentam
th: เก็บที่คั่นหน้าเป็นรายการเดียวสำหรับเอกสารที่ผสานแต่ละฉบับ

source: What to do in case one or more input documents contain bookmarks
ar: ماذا يجب فعله في حال احتوى مستند واحد أو أكثر من المستندات المُدخلة على إشارات مرجعية
lv: Ko darīt, ja kādā no ievades dokumentiem ir grāmatzīmes
th: จะจัดการอย่างไรหากเอกสารนำเข้าอย่างน้อยหนึ่งฉบับมีบุ๊กมาร์ก

source: Don't generate
ar: عدم الإنشاء
lv: Negenerēt
th: ไม่ต้องสร้าง

source: Generate from file names
ar: إنشاء من أسماء الملفات
lv: Veidot no datņu nosaukumiem
th: สร้างจากชื่อไฟล์

source: Generate from documents titles
ar: إنشاء عناوين من المستندات
lv: Veidot no dokumentu virsrakstiem
th: สร้างจากหัวข้อเอกสาร

source: Set if a table of contents should be added to the generated PDF document
ar: تعيين ما إذا كان يجب إضافة جدول محتويات إلى مستند PDF الناتج
lv: Iestatiet, ja izveidotajam PDF dokumentam vajadzētu pievienot satura rādītāju
th: ตั้งค่าให้เพิ่มสารบัญในเอกสาร PDF ที่สร้างขึ้น

source: Merge
ar: دمج
lv: Apvienot
th: รวม

source: Select or drag and drop the PDF whose pages will be repeated
ar: حدد أو اسحب وأفلِت ملف PDF الذي سيتم تكرار صفحاته
lv: Atlasiet vai ievelciet un nometiet PDF failu, kura lapas tiks atkārtotas
th: เลือกหรือลากและวางไฟล์ PDF ที่ต้องการทำซ้ำหน้า

source: Repeat these pages:
ar: كرر هذه الصفحات:
lv: Atkārtot šīs lapas:
th: ทำซ้ำหน้าเหล่านี้:

source: Pages to repeat (ex: 2 or 5-23 or 2,5-7,12-)
ar: الصفحات المراد تكرارها (على سبيل المثال: 2 أو 5-23 أو 2، 5-7، 12-)
lv: Atkārtojamās lapas (piem.: 2 vai 5-23 vai 2,5-7,12-)
th: หน้าที่ต้องการทำซ้ำ (เช่น: 2 หรือ 5-23 หรือ 2,5-7,12-)

source: Comma separated page numbers or ranges to be repeated (ex: 2 or 5-23 or 2,5-7,12-)
ar: أرقام الصفحات أو النطاقات التي سيتم تكرارها مفصولة بفواصل (على سبيل المثال: 2 أو 5-23 أو 2، 5-7، 12-)
lv: Ar komatiem atdalīti lappušu numuri vai diapazoni atkārtošanai (piem: 2 vai 5-23 vai 2,5-7,12-)
th: หมายเลขหน้าหรือช่วงที่คั่นด้วยเครื่องหมายจุลภาคที่จะทำซ้ำ (เช่น 2 หรือ 5-23 หรือ 2,5-7,12-)

source: Leave it empty to use all the pages of the PDF file
ar: اتركه فارغًا لاستخدام جميع صفحات ملف PDF
lv: Atstājiet tukšu, lai izmantotu visas PDF faila lapas
th: เว้นว่างไว้เพื่อใช้ทุกหน้าของไฟล์ PDF

source: Repeat every "n" pages:
ar: كرر كل "n" صفحة:
lv: Atkārtot ik pēc "n" lapām:
th: ทำซ้ำทุก n หน้า:

source: Invalid page number
ar: رقم الصفحة غير صالح
lv: Nederīgs lapas numurs
th: หมายเลขหน้าไม่ถูกต้อง

source: Repeat the selected pages every "n" pages of the original document
ar: كرار الصفحات المحددة كل 'n' صفحات من المستند الأصلي
lv: Atkārtot atlasītās lapas ik pēc "n" lapām no oriģinālā dokumenta
th: ทำซ้ำหน้ากระดาษที่เลือกทุกๆ "n" หน้าของเอกสารต้นฉบับ

source: The selected PDF file is invalid
ar: ملف PDF المحدد غير صالح
lv: Izvēlētais PDF fails nav derīgs
th: ไฟล์ PDF ที่เลือกไม่ถูกต้อง

source: The number of pages must be a positive number
ar: يجب أن يكون عدد الصفحات عددًا موجبًا
lv: Lapu skaitam jābūt pozitīvam skaitlim
th: จำนวนหน้าต้องเป็นจำนวนเต็มบวก

source: Select or drag and drop the PDF you want to insert pages to
ar: حدد أو اسحب وأفلِت ملف PDF الذي تريد إدراج الصفحات فيه
lv: Atlasiet vai velciet un nometiet PDF failu, kurā vēlaties ievietot lapas
th: เลือกหรือลากและวางไฟล์ PDF ที่ต้องการแทรกหน้า

source: Insert and Repeat settings
ar: إعدادات الإدراج والتكرار
lv: Ievietošanas un Atkārtošanas iestatījumi
th: แทรกและทำซ้ำการตั้งค่า

source: Insert pages multiple times
ar: إدراج الصفحات عدة مرات
lv: Ievietot lapas vairākas reizes
th: แทรกหน้าหลายครั้ง

source: Insert the pages of a PDF document A into another document B, repeating it after a certain number of pages, resulting in B1 A B2 A B3 A etc.
ar: قم بإدراج صفحات مستند PDF A في مستند آخر B، وتكرار ذلك بعد عدد معين من الصفحات، مما يؤدي إلى B1 A B2 A B3 A وهكذا.
lv: Ievietot PDF dokumenta A lapas citā dokumentā B, atkārtojot to pēc noteikta lapu skaita, kā rezultātā veidojas B1 A B2 A B3 A utt.
th: แทรกหน้าจากเอกสาร PDF A ลงในเอกสาร B โดยทำซ้ำหลังจากจำนวนหน้าที่กำหนด ได้ผลลัพธ์เป็น B1 A B2 A B3 A เป็นต้น

source: Started in {0}
ar: بدأ في {0}
lv: Sākts {0}
th: เริ่ม {0}

source: Closing PDFsam...
ar: جاري إغلاق البرنامج PDFsam ...
lv: Aizver PDFsam...
th: กำลังปิด PDFsam...

source: Drag and drop PDF files or directories containing PDF files
ar: اسحب وأفلت ملفات PDF أو المجلدات التي تحتوي على ملفات PDF
lv: Vilkt un nomest PDF failus vai mapes, kas satur PDF failus
th: ลากและวางไฟล์ PDF หรือไดเรกทอรีที่มีไฟล์ PDF

source: No PDF found
ar: لم يتم العثور على ملف PDF
lv: Nav atrasts neviens PDF
th: ไม่พบ PDF

source: Tools
ar: أدوات
lv: Rīki
th: เครื่องมือ

source: News
ar: أخبار
lv: Jaunumi
th: ข่าว

source: What's new
ar: ما الجديد
lv: Kas jauns
th: มีอะไรใหม่

source: Exit
ar: الخروج
lv: Iziet
th: ออก

source: Exit the application
ar: الخروج من التطبيق
lv: Iziet no lietojumprogrammas
th: ออกจากโปรแกรม

source: Workspace
ar: مساحة العمل
lv: Darbvieta
th: พื้นที่ทำงาน

source: Manage your workspaces
ar: إدارة مساحات العمل الخاصة بك
lv: Pārvaldīt jūsu darbvietas
th: จัดการพื้นที่ทำงานของคุณ

source: Yes
ar: نعم
lv: Jā
th: ใช่

source: No
ar: لا
lv: Nē
th: ไม่

source: Do you confirm?
ar: هل تؤكد ذلك؟
lv: Vai apstiprināt?
th: คุณยืนยัน?

source: Clear the tool settings
ar: مسح إعدادات الأداة
lv: Notīrīt rīka iestatījumus
th: ล้างการตั้งค่าเครื่องมือ

source: Clear the selection table
ar: مسح جدول الاختيار
lv: Notīrīt atlases tabulu
th: ล้างตารางการเลือก

source: Open with
ar: افتح باستخدام
lv: Atvērt ar
th: เปิดด้วย

source: Select the task to perform on the following files
ar: حدد المهمة التي تريد تنفيذها على الملفات التالية
lv: Izvēlieties uzdevumu veikt ar sekojošajiem failiem
th: เลือกงานที่จะดำเนินการกับไฟล์ต่อไปนี้

source: Directory not empty
ar: الدليل غير فارغ
lv: Mape nav tukša
th: ไดเรกทอรีไม่ว่างเปล่า

source: The selected directory is not empty
ar: الدليل المحدد ليس فارغًا
lv: Izvēlētā direktorija nav tukša
th: ไดเร็กทอรีที่เลือกไม่ว่างเปล่า

source: What would you like to do in case of files with the same name?
ar: ماذا تريد أن تفعل في حالة وجود ملفات بنفس الاسم؟
lv: Ko vēlaties darīt ar failiem ar vienādu nosaukumu?
th: คุณต้องการทำอะไรในกรณีของไฟล์ที่มีชื่อเดียวกัน

source: Overwrite
ar: الكتابة فوق الملف واستبداله
lv: Pārrakstīt
th: แทนที่

source: Rename
ar: إعادة تسمية
lv: Pārsaukt
th: เปลี่ยนชื่อ

source: Skip
ar: تخطي
lv: Izlaist
th: ข้าม

source: Cancel
ar: إلغاﺀ
lv: Atcelt
th: ยกเลิก

source: Don't overwrite existing file
ar: لا تقم باستبدال الملف الموجود
lv: Nepārrakstīt esošo failu
th: อย่าเขียนทับไฟล์ที่มีอยู่

source: Overwrite confirmation
ar: تأكيد الكتابة فوق
lv: Pārrakstīšanas apstiprinājums
th: ยืนยันการเขียนทับ

source: A file with the given name already exists
ar: يوجد ملف بالاسم المحدد بالفعل
lv: Fails ar norādīto nosaukumu jau pastāv
th: มีไฟล์ชื่อนี้อยู่แล้ว

source: What would you like to do?
ar: ماذا تود أن تفعل؟
lv: Ko vēlaties darīt?
th: คุณต้องการจะทำอะไร?

source: Non existing directory
ar: دليل غير موجود
lv: Neeksistējoša direktorija
th: ไม่มีไดเรกทอรีที่มีอยู่

source: The selected output directory does not exist
ar: دليل الإخراج المحدد غير موجود
lv: Izvēlētā izvades direktorija nepastāv
th: directory ที่เลิอกไม่มีอยู่

source: Do you want to create it?
ar: هل تريد إنشاءه؟
lv: Vai vēlaties to izveidot?
th: ต้องการสร้าง?

source: Subdirectories
ar: المجلدات الفرعية
lv: Apakšmapes
th: ไดเรกทอรีย่อย

source: Subdirectories have been found
ar: تم العثور على المجلدات الفرعية
lv: Apakšdirektoriji ir atrasti
th: พบไดเร็กทอรีย่อยแล้ว

source: Do you want to add PDF files found in subdirectories?
ar: هل تريد إضافة ملفات PDF الموجودة في المجلدات الفرعية؟
lv: Vai vēlaties pievienot PDF failus, atrastus apakšmapēs?
th: คุณต้องการเพิ่มไฟล์ PDF ที่พบในไดเรกทอรีย่อยหรือไม่?

source: Task failed
ar: فشلت المهمة
lv: Uzdevums neizdevās
th: งานล้มเหลว

source: PDFsam can try to overcome the failure
ar: يمكن لـ PDFsam محاولة التغلب على الفشل
lv: PDFsam var mēģināt pārvarēt kļūmi
th: PDFsam สามารถพยายามเอาชนะความล้มเหลว

source: It may result in PDF files with partial or missing data, proceed anyway?
ar: قد يؤدي ذلك إلى إنشاء ملفات PDF تحتوي على بيانات جزئية أو مفقودة، هل تريد المتابعة على أي حال؟
lv: Tas var radīt PDF failus ar nepilnīgiem vai trūkstošiem datiem, tomēr turpināt?
th: อาจส่งผลให้ไฟล์ PDF มีข้อมูลบางส่วนหรือขาดหายไปดำเนินการต่อไปหรือไม่?

source: Removes all the log messages
ar: يزيل جميع رسائل السجل
lv: Dzēš visus žurnālziņojumus
th: ลบข้อความบันทึกทั้งหมด

source: _Clear
ar: إفراغ
lv: _Notīrīt
th: _ล้าง

source: _Save
ar: _حفظ
lv: _Saglabāt
th: _บันทึก

source: C_lose
ar: أ_غلق
lv: A_izvērt
th: C_ปิด

source: Copy
ar: نسخ
lv: Kopēt
th: คัดลอก

source: Clear
ar: إزالة
lv: Notīrīt
th: ล้าง

source: Select all
ar: اختر الكلّ
lv: Atlasīt visu
th: เลือกทั้งหมด

source: Save log
ar: احفظ السجلّ
lv: Saglabāt žurnālu
th: บันทึกปูม

source: Select where to save the log file
ar: حدد مكان حفظ ملف السجل
lv: Izvēlieties kur saglabāt žurnālfailu
th: เลือกตำแหน่งที่จะบันทึกไฟล์บันทึก

source: Logs
ar: السجلات
lv: Žurnāli
th: บันทึก

source: Application messages
ar: رسائل التطبيق
lv: Lietojumprogrammas ziņojumi
th: ข้อความ

source: _Load
ar: _حمِّل
lv: _Ielādēt
th: _โหลด

source: Recen_ts
ar: مؤ_خرًا
lv: Pēdēj_ie
th: ล่าสุ_ด

source: _Clear recents
ar: _مسح الأخيرة
lv: _Notīrīt nesenās
th: ล้างรายการล่าสุด

source: Select the workspace file to save
ar: حدد ملف مساحة العمل لحفظه
lv: Atlasiet darbvietas failu saglabāšanai
th: เลือก workspace เพื่อบันทึก

source: Select the workspace to load
ar: حدد مساحة العمل للتحميل
lv: Atlasiet darbvietu ielādēšanai
th: เลือก workspace เพื่อโหลด

source: Subscribe to the official news feed
ar: اشترك في قناة الاخبار الرسمية
lv: Abonēt oficiālo ziņu plūsmu
th: รับข่าวจาก official

source: Environment
ar: بيئة
lv: Vide
th: แสดงสภาพแวดล้อม

source: Vendor: %s
ar: البائع: %s
lv: Izstrādātājs: %s
th: ผู้ขาย: %s

source: JavaFX runtime version: %s
ar: إصدار وقت تشغيل JavaFX: %s
lv: JavaFX izpildlaika versija: %s
th: เวอร์ชันรันไทม์ JavaFX: %s

source: PDF engine (Sejda SDK) version: %s
ar: إصدار محرك PDF (Sejda SDK): %s
lv: PDF dzinējs (Sejda SDK) versija: %s
th: เอนจิน PDF (Sejda SDK) เวอร์ชัน: %s

source: Max memory {0}
ar: الحد الأقصى للذاكرة {0}
lv: Maks. atmiņa {0}
th: หน่วยความจำสูงสุด {0}

source: Copy to clipboard
ar: نسخ إلى الحافظة
lv: Kopēt uz starpliktuvi
th: คัดลอกไปยังคลิปบอร์ด

source: Support
ar: دعم
lv: Atbalsts
th: สนับสนุน

source: Bug and feature requests
ar: طلبات الأخطاء والميزات
lv: Kļūdu un funkciju pieprasījumi
th: แจ้ง Bug และ feature

source: Documentation
ar: التّوثيق
lv: Dokumentācija
th: เอกสารประกอบ

source: Contribute
ar: مساهمة
lv: Ieguldīt
th: มีส่วนร่วม

source: Translate
ar: الترجمة
lv: Tulkot
th: แปลภาษา

source: Donate
ar: تبرّع
lv: Ziedot
th: บริจาค

source: Social
ar: اجتماعي
lv: Sociālie
th: สังคม

source: Like us on Facebook
ar: اعجب بصفحتنا على الفيسبوك
lv: Patīk mums Facebook
th: Like ใน Facebook

source: About
ar: حول
lv: Par
th: เกี่ยวกับ

source: Home
ar: الرئيسية
lv: Sākums
th: หน้าแรก

source: Premium features
ar: مميزات العضوية المميزة
lv: Premium funkcijas
th: คุณสมบัติระดับพรีเมียม

source: Maximum number of rows displayed by the Log register
ar: العدد الأقصى للصفوف المعروضة في سجل التسجيل
lv: Žurnāla reģistra maksimālais attēloto rindu skaits
th: จำนวนแถวสูงสุดที่แสดงโดย Log register

source: Set your preferred language (restart needed)
ar: قم بتعيين اللغة المفضلة لديك (يلزم إعادة التشغيل)
lv: Iestatīt savu vēlamo valodu (pārstartēšana nepieciešama)
th: ตั้งค่าภาษาที่ต้องการ (ต้องเรียกใช้งานโปรแกรมใหม่)

source: Set the tool to open at application startup (restart needed)
ar: ضبط الأداة ليتم فتحها عند بدء تشغيل التطبيق (يلزم إعادة التشغيل)
lv: Iestatīt rīka atvēršanu, palaižot lietojumprogrammu (nepieciešama restartēšana)
th: ตั้งค่าเครื่องมือให้เปิดเมื่อเริ่มต้นแอปพลิเคชัน (ต้องรีสตาร์ท)

source: Set the application theme
ar: تعيين مظهر التطبيق
lv: Iestatīt lietotnes tēmu
th: ตั้งค่าธีมแอปพลิเคชัน

source: Set the application font size
ar: تعيين حجم الخط في التطبيق
lv: Iestatīt lietotnes fonta lielumu
th: ตั้งค่าขนาดตัวอักษรของแอปพลิเคชัน

source: Manually selected
ar: محدد يدويًا
lv: Manuāli atlasīts
th: เลือกเอง

source: Automatically set the destination directory to the selected PDF document directory
ar: تعيين دليل الوجهة تلقائيًا إلى دليل مستند PDF المحدد
lv: Automātiski iestatīt mērķa direktoriju uz atlasītā PDF dokumenta direktoriju
th: เลือก directory เป้าหมายเป็นที่เดียวกับไฟล์ PDF

source: Settings
ar: الإعدادات
lv: Iestatījumi
th: การตั้งค่า

source: Appearance
ar: المظهر
lv: Izskats
th: หน้าตาระบบ

source: Behavior
ar: السلوك
lv: Uzvedība
th: ลักษณะการทำงาน

source: Output
ar: المُخرجات
lv: Izvade
th: ผลลัพธ์

source: Check for updates now
ar: التحقق من التحديثات الآن
lv: Pārbaudīt atjauninājumus tagad
th: ตรวจสอบการอัปเดตทันที

source: Select a directory where documents will be saved and loaded by default
ar: حدد المجلد الذي سيتم حفظ المستندات وتحميلها فيه افتراضيًا
lv: Izvēlieties mapi, kur dokumenti tiks saglabāti un ielādēti pēc noklusējuma
th: เลือกที่เก็บปริยายสำหรับเอาไว้บันทึกและโหลดไฟล์

source: Select a directory
ar: اختر المجلد
lv: Atlasīt mapi
th: เลือกไดเร็กทอรี
